In [1]:
import pandas as pd
import numpy as np

In [210]:
df=pd.read_csv('Titanic_dataset.csv')

In [212]:
df=df.copy()

In [214]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [216]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [218]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

### 1. Kazada ölenlerin yaş ortalamasını bulunuz

In [221]:
mean_age_dead = df[df['Survived'] == 0]['Age'].mean()
mean_age_dead

30.62617924528302

### 2. Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [226]:
dead_fares = df[df['Survived'] == 0]['Fare']
mean_fare_dead = dead_fares.mean()
median_fare_dead = dead_fares.median()
mean_fare_dead, median_fare_dead

(22.117886885245902, 10.5)

### 3. Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [229]:
mean_age_dead_male = df[(df['Survived'] == 0) & (df['Sex'] == 'male')]['Age'].mean()
mean_age_dead_male

31.618055555555557

### 4. Kazada ölen kadınların yaş ortalamasını bulunuz

In [232]:
mean_age_dead_female = df[(df['Survived'] == 0) & (df['Sex'] == 'female')]['Age'].mean()
mean_age_dead_female

25.046875

### 5. Kazadan kurtulanların yaş ortalamasını bulunuz

In [237]:
mean_age_survived = df[df['Survived'] == 1]['Age'].mean()
mean_age_survived

28.343689655172415

### 6. Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [240]:
mean_fare_survived = df[df['Survived'] == 1]['Fare'].mean()
mean_fare_survived

48.39540760233918

### 7. Kazadan kurtulan toplam kişi sayısını bulunuz

In [243]:
survivor_count = len(df[df['Survived'] == 1])
survivor_count

342

### 8. 10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [248]:
median_fare_under_10 = df[df['Age'] < 10]['Fare'].median()
median_fare_under_10

27.0

### 9. 1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız

In [251]:

classes = [1, 2, 3]
means = []
medians = []

for cls in classes:
    cls_data = df[df['Pclass'] == cls]['Fare']
    mean_val = cls_data.mean()
    median_val = cls_data.median()
    means.append(mean_val)
    medians.append(median_val)
    print(f"Pclass {cls} - Ortalama: {mean_val:.2f}, Medyan: {median_val:.2f}")

Pclass 1 - Ortalama: 84.15, Medyan: 60.29
Pclass 2 - Ortalama: 20.66, Medyan: 14.25
Pclass 3 - Ortalama: 13.68, Medyan: 8.05

### 10. Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız

In [256]:
dead_males = df[(df['Survived'] == 0) & (df['Sex'] == 'male')]
dead_females = df[(df['Survived'] == 0) & (df['Sex'] == 'female')]

total_males = df[df['Sex'] == 'male']
total_females = df[df['Sex'] == 'female']

male_death_rate = len(dead_males) / len(total_males)
female_death_rate = len(dead_females) / len(total_females)

print(f"Erkeklerde ölüm oranı: {male_death_rate:.2%}")
print(f"Kadınlarda ölüm oranı: {female_death_rate:.2%}")

Erkeklerde ölüm oranı: 81.11%
Kadınlarda ölüm oranı: 25.80%